app/controllers/api/v1/movies_controller.rb

INSERT INTO "movies" ("title", "movie_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Janym ty ne poveriw"], ["movie_list_id", 3], ["created_at", "2020-09-02 22:22:52.225652"], ["updated_at", "2020-09-02 22:22:52.225652"]]
---
            def create
                @movie = @movie_list.movies.new(movies_params)

                if @movie.save

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]
---
            def destroy
            #   movie_list = MovieList.find(params[:id])
              @movie.destroy

UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "boicovski club"], ["updated_at", "2020-09-02 22:24:53.227776"], ["id", 3]]
---
            def update
              if @movie.update_attributes(movies_params)

SELECT "movie_lists".* FROM "movie_lists" WHERE "movie_lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
            def get_movie_list
                @movie_list = MovieList.find(params[:movie_list_id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
            def get_movie
                @movie = Movie.find(params[:id])