app/controllers/api/v1/movie_lists_controller.rb

            def index
                movie_lists = MovieList.all
                movie_lists = movie_lists.map{|ml| {id: ml.id, title:ml.title, movieNum:ml.movies.length}}
---
SELECT "movie_lists".* FROM "movie_lists"
SELECT "movie_lists".* FROM "movie_lists" ORDER BY created_at DESC
SELECT "movies".* FROM "movies" WHERE "movies"."movie_list_id" = ?  [["movie_list_id", 1]]

            def show
                movie_list = MovieList.find(params[:id])
---
SELECT "movie_lists".* FROM "movie_lists" WHERE "movie_lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

            def create
                movie_list = MovieList.new(movie_list_params)

                if movie_list.save
---
INSERT INTO "movie_lists" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "asdfadsf"], ["created_at", "2020-09-03 10:36:33.186163"], ["updated_at", "2020-09-03 10:36:33.186163"]]

            def destroy
              movie_list = MovieList.find(params[:id])
              movie_list.destroy
---
SELECT "movie_lists".* FROM "movie_lists" WHERE "movie_lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "movie_lists" WHERE "movie_lists"."id" = ?  [["id", 2]]

            def update
              movie_list = MovieList.find(params[:id])
              if movie_list.update_attributes(movie_list_params)
---
SELECT "movie_lists".* FROM "movie_lists" WHERE "movie_lists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "movie_lists" SET "title" = ?, "updated_at" = ? WHERE "movie_lists"."id" = ?  [["title", "English movies"], ["updated_at", "2020-09-02 21:22:41.875445"], ["id", 5]]